tests/suite-root-url-test/15000-conc-500/ab_report.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.0.0.14 (be patient)


Server Software:        WEBrick/1.3.1
Server Hostname:        10.0.0.14
Server Port:            80

Document Path:          /
Document Length:        547 bytes

Concurrency Level:      500
Time taken for tests:   116.539 seconds
Complete requests:      15000
Failed requests:        0
Keep-Alive requests:    15000
Total transferred:      13245000 bytes
HTML transferred:       8205000 bytes
Requests per second:    128.71 [#/sec] (mean)
Time per request:       3884.647 [ms] (mean)
Time per request:       7.769 [ms] (mean, across all concurrent requests)
Transfer rate:          110.99 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.5      0      12
Processing:   184 3843 2466.2   3523   26500
Waiting:      184 3843 2466.2   3523   26500
Total:        184 3843 2466.2   3533   26500

Percentage of the requests served within a certain time (ms)
  50%   3533
  66%   4253
  75%   4751
  80%   5241
  90%   6751
  95%   8743
  98%  10763
  99%  12246
 100%  26500 (longest request)